DataProcessors/МониторПовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>МониторПовара</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзятВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ЗаказПокупателя</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стол</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Столы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоГостей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Повар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Блюда</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Блюдо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БлюдоГотово</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/МониторПовара/Forms/Форма1/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодготовитьНачальныеДанные();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)    
	
	ПодключитьОбработчикОжидания("ОбновитьТаймер", 1);
	
КонецПроцедуры


&НаСервере
Процедура ПодготовитьНачальныеДанные()
	
	ТекущийСотрудник = ПараметрыСеанса.ТекущийСотрудник;
	
	#область Заполнить_один_тренировочный_заказ
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателяБлюда.Блюдо КАК Блюдо,
		|	ЗаказПокупателяБлюда.Количество КАК Количество,
		|	ЗаказПокупателяБлюда.Блюдо.ВремяПриготовления КАК ВремяПриготовления,
		|	ЗаказПокупателяБлюда.Ссылка КАК Заказ,
		|	ЗаказПокупателяБлюда.Ссылка.Стол КАК Стол,
		|	ЗаказПокупателяБлюда.Ссылка.КоличествоГостей КАК КоличествоГостей,
		|	ЗаказПокупателяБлюда.Ссылка.Дата КАК Дата,
		|	ЗаказПокупателяБлюда.Ссылка.Номер КАК Номер,
		|	ЗаказПокупателяБлюда.Ссылка.Стол.Представление КАК СтолПредставление
		|ИЗ
		|	Документ.ЗаказПокупателя.Блюда КАК ЗаказПокупателяБлюда
		|ГДЕ
		|	ЗаказПокупателяБлюда.Ссылка.СтатусЗаказа В(&СтатусыЗаказа)
		|	И ЗаказПокупателяБлюда.Ссылка.Проведен = ИСТИНА
		|ИТОГИ
		|	МАКСИМУМ(Стол),
		|	МАКСИМУМ(КоличествоГостей),
		|	МАКСИМУМ(Дата),
		|	МИНИМУМ(Номер)
		|ПО
		|	Заказ";
	
	СтатусыЗаказа = Новый Массив;
	СтатусыЗаказа.Добавить(Перечисления.СтатусыЗаказов.Новый);
	СтатусыЗаказа.Добавить(Перечисления.СтатусыЗаказов.ВзятВРаботу);
	
	Запрос.УстановитьПараметр("СтатусыЗаказа", СтатусыЗаказа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаказ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаЗаказ.Следующий() Тогда

		НомерЗаказа = 1;	
		Заказ = ВыборкаЗаказ.Заказ; 
		ЗаказПредставление = СтрШаблон("Заказ №%1 (гостей %2)%3Стол %4",
								ВыборкаЗаказ.Номер,
								ВыборкаЗаказ.КоличествоГостей,
								Символы.ПС,
								ВыборкаЗаказ.СтолПредставление);
								
		ВремяОжидания = ВыборкаЗаказ.Дата;
		
		ВыборкаДетальныеЗаписи = ВыборкаЗаказ.Выбрать();
			
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СтрокаТаблицы = ТаблицаЗаказ.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ВыборкаДетальныеЗаписи);
			
		КонецЦикла;
	КонецЕсли;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
             
	#КонецОбласти

КонецПроцедуры


&НаКлиенте
Процедура ОбновитьТаймер()

	ТекущаяДата = ТекущаяДата();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
